Autodesk.Navisworks.Api.GridLine
A Grid Line

Autodesk.Navisworks.Api.GridLine.DisplayName
Name of GridLine as diplayed in the GUI.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridLine.IsReadOnly
Gets a value indicating whether the object is read-only.